{
  "arr" : [
    {
      "task": "На прием к врачу-терапевту приходят пациенты двух типов: 1) пришедшие на прием вторично, и время их прихода распределено равномерно в интервале A минут; 2) пришедшие на прием в первый раз, время их прихода распределено равномерно в интервале B минут. Время приёма пациентов первого типа распределено равномерно в интервале C минут, а второго типа – D минут. Модель работы врача должна обеспечить сбор статистики об очереди. Необходимо промоделировать работу врача в течение E часов.",
      "bRange": ["2", "4"],
      "compoAssessment": ["if(utilization < 0.50 || content > 30 || timePerTrans > 30) {return 'низкая';} else if(utilization < 0.60 || content > 15 || timePerTrans > 15) {return 'ниже средней';} else if(utilization < 0.70 || content > 10 || timePerTrans > 10) {return 'средняя';} else if(utilization < 0.80 || content > 5 || timePerTrans > 5) {return 'выше средней';}return 'высокая';"]
    },
    {
      "task": "В библиотеку приходят читатели двух типов: пришедшие в библиотеку в первый раз и пришедшие повторно. Интервалы прихода читателей первого типа распределены равномерно через A минут, второго – B минут. Время работы с читателями первого типа распределено равномерно в интервале C минут, второго типа – D минут. Модель работы библиотекаря должна обеспечить сбор статистики об очереди. Необходимо промоделировать работу библиотекаря в течение E часов.",
      "bRange": ["2", "20"],
      "compoAssessment": ["if(utilization < 0.50 || content > 30 || timePerTrans > 30) {return 'низкая';} else if(utilization < 0.60 || content > 15 || timePerTrans > 15) {return 'ниже средней';} else if(utilization < 0.70 || content > 10 || timePerTrans > 10) {return 'средняя';} else if(utilization < 0.80 || content > 5 || timePerTrans > 5) {return 'выше средней';}return 'высокая';"]
    },
    {
      "task":     "В билетную кассу аэрофлота приходят пассажиры двух типов: первого типа – приобретающие авиабилеты; второго типа – меняющие имеющиеся у них авиабилеты. Приход пассажиров первого типа распределен равномерно в интервале A минут, второго типа распределен равномерно в интервале B минут. Время обслуживания пассажиров первого типа распределено равномерно в интервале C минут, а второго – D минут. Модель работы билетной кассы аэрофлота должна обеспечить сбор статистики об очереди. Необходимо промоделировать работу кассы в течение E часов.",
      "bRange": ["2", "20"],
      "compoAssessment": ["if(utilization < 0.50 || content > 30 || timePerTrans > 30) {return 'низкая';} else if(utilization < 0.60 || content > 15 || timePerTrans > 15) {return 'ниже средней';} else if(utilization < 0.70 || content > 10 || timePerTrans > 10) {return 'средняя';} else if(utilization < 0.80 || content > 5 || timePerTrans > 5) {return 'выше средней';}return 'высокая';"]
    },
    {
      "task":  "В пункт обмена валюты приходят клиенты двух типов: 1) желающие купить валюту, интервалы прихода этих клиентов распределены равномерно в интервале A минут; 2) желающие сдать одну валюту и купить другую, интервалы их прихода распределены равномерно в интервале B минут. Время обслуживания клиентов первого типа равномерно распределено в интервале C минут, второго типа – D минут. Модель работы обменного пункта должна обеспечить сбор статистики об очереди. Необходимо промоделировать работу пункта в течение E часов. ",
      "bRange": ["2", "20"],
      "compoAssessment": ["if(utilization < 0.50 || content > 30 || timePerTrans > 30) {return 'низкая';} else if(utilization < 0.60 || content > 15 || timePerTrans > 15) {return 'ниже средней';} else if(utilization < 0.70 || content > 10 || timePerTrans > 10) {return 'средняя';} else if(utilization < 0.80 || content > 5 || timePerTrans > 5) {return 'выше средней';}return 'высокая';"]
    },
    {
      "task": "На почту с одним окном для приема телеграмм приходят клиенты двух типов: 1) желающие дать телеграмму в пределах страны, интервалы их прихода распределены равномерно в интервале A минут; 2) желающие дать телеграмму за рубеж, интервалы их прихода распределены равномерно в интервале B минут. Время приема телеграмм у клиентов первого типа распределено равномерно в интервале C минут, второго типа – D минут. Модель работы окна приема телеграмм должна обеспечить сбор статистики об очереди. Необходимо промоделировать работу окна приема телеграмм в течение E часов. ",
      "bRange": ["2", "10"],
      "compoAssessment": ["if(utilization < 0.50 || content > 30 || timePerTrans > 30) {return 'низкая';} else if(utilization < 0.60 || content > 15 || timePerTrans > 15) {return 'ниже средней';} else if(utilization < 0.70 || content > 10 || timePerTrans > 10) {return 'средняя';} else if(utilization < 0.80 || content > 5 || timePerTrans > 5) {return 'выше средней';}return 'высокая';"]
    }
  ],
  "programm": "GENERATE a,aRange ; \nQUEUE LIN ; \nSEIZE REG\nDEPART LIN ; \nADVANCE c,cRAnge ;\nRELEASE REG \nTERMINATE ; \nGENERATE b,bRAnge ; \nQUEUE LIN\nSEIZE REG\nDEPART LIN\nADVANCE d,dRAnge ;\nRELEASE REG\nTERMINATE ; \nGENERATE simulationTime; \nTERMINATE 1\nSTART 1\nend"
}