{
  "taskNumber": 8,
  "arr" : [
    "Промоделировать работу медицинского пункта (сначала – с одним врачом). Интервалы приходов пациентов распределены равномерно в интервале A минут. Время приёма B также распределено равномерно. Пациенты принимаются в порядке «первым пришёл – первым обслужен». Модель работы медицинского пункта должна обеспечить сбор стандартной статистики об очереди. Необходимо промоделировать работу пункта в течение C часов. Если моделируемая система работает с перегрузкой (неэффективно), то увеличьте число врачей (т. е., каналов обслуживания). С помощью экспериментов с моделью, изменяя емкость памяти, определите минимальное число врачей, при котором медицинский пункт работает без перегрузки.",
    "Промоделировать работу библиотеки (сначала – с одним библиотекарем). Интервалы прихода читателей распределены равномерно в интервале A минут. Время работы B с читателями также распределено равномерно. Читатели обслуживаются в порядке «первым пришёл – первым обслужен». Модель работы библиотеки должна обеспечить сбор стандартной статистики об очереди. Необходимо промоделировать работу библиотеки в течение C часов. Если моделируемая система работает с перегрузкой (неэффективно), то увеличьте число библиотекарей (т. е., каналов обслуживания). С помощью экспериментов с моделью, изменяя емкость памяти, определите минимальное число библиотекарей, при котором библиотека работает без перегрузки. ",
    "Промоделировать работу пункта продажи билетов аэрофлота (сначала – с одним кассиром). Интервалы прихода пассажиров распределены равномерно, в интервале A минут. Время обслуживания B также распределено равномерно. Пассажиры обслуживаются в порядке «первым пришёл – первым обслужен». Модель работы пункта продажи билетов должна обеспечить сбор стандартной статистики об очереди. Необходимо промоделировать работу пункта в течение C часов. Если моделируемая система работает с перегрузкой (неэффективно), то увеличьте число кассиров (т. е., каналов обслуживания). С помощью экспериментов с моделью, изменяя емкость памяти, определите минимальное число кассиров, при котором пункт продажи билетов работает без перегрузки.",
    "Промоделировать работу пункта обмена валюты (сначала – с одним окном). Интервалы прихода клиентов распределены равномерно, A минут. Время обслуживания так же равномерно распределено по B минут. Клиенты обслуживаются в порядке «первым пришёл – первым обслужен». Модель работы обменного пункта должна обеспечить сбор стандартной статистики об очереди. Необходимо промоделировать работу пункта в течение C часов. Если моделируемая система работает с перегрузкой (неэффективно), то увеличьте число окон обслуживания (т. е., каналов обслуживания). С помощью экспериментов с моделью, изменяя емкость памяти, определите минимальное число окон обслуживания, при котором пункт обмена валюты работает без перегрузки.",
    "Промоделировать работу почты (сначала – с одним окном приема корреспонденции). Интервалы прихода клиентов распределены равномерно в интервале A минут. Время приема телеграмм так же распределено равномерно B минут. Обслуживание ведется в порядке «первым пришел – первым обслужен». Модель работы почты должна обеспечить сбор стандартной статистики об очереди.  Необходимо промоделировать работу почты в течение C часов. Если моделируемая система работает с перегрузкой (неэффективно), то увеличьте число окон приема корреспонденции (т. е., каналов обслуживания). С помощью экспериментов с моделью, изменяя емкость памяти, определите минимальное число окон приема корреспонденции, при котором почта работает без перегрузки."
  ],
  "programm": "COL  STORAGE I   \nGENERATE  a,aRange\nQUEUE OCH\n ENTER  COL  \nDEPART  OCH \nADVANCE  b,bRAnge \nLEAVE  COL  \n TERMINATE  \nGENERATE  simulationTime \nTERMINATE  1  \nSTART 1\n\nend;"
}